# Cierre del dia miercoles parte 2
## Convertir las tuplas a indices

In [3]:
import pandas as pd
import numpy as np

afuera=['G1','G2','G1','G2','G1','G2']
adentro=[1,2,3,1,2,3]
indices= list(zip(afuera, adentro))
indices
indices = pd.MultiIndex.from_tuples(indices)
indices

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 1, 0, 1, 0, 1], [0, 1, 2, 0, 1, 2]])

In [4]:
# checamos
type(indices)

pandas.indexes.multi.MultiIndex

In [7]:
#
from numpy.random import randn
df = pd.DataFrame(randn(6,2), indices, ['A','B']) # cabeceras AB, los indices es Muti-index

In [8]:
df

             A         B
G1 1  0.527764 -0.059396
G2 2 -0.260474  0.695451
G1 3  2.056846  0.004159
G2 1 -0.804568 -1.303475
G1 2  0.896088 -0.561643
G2 3 -0.203498 -0.007985

In [10]:
df.loc['G1'].loc[1] # loc es la linea, toda la capa

A    0.527764
B   -0.059396
Name: 1, dtype: float64

In [12]:
# un solo valor
df.loc['G2'].loc[3]['B']

-0.0079852108284415076

In [19]:
# Método sección cruzada (cross section) TODO
df.xs('G1')

          A         B
1  0.527764 -0.059396
3  2.056846  0.004159
2  0.896088 -0.561643

#

In [20]:
#---
df.xs(1,level=1)

           A         B
G1  0.527764 -0.059396
G2 -0.804568 -1.303475

# DATOS PERDIDOS

In [21]:
# Cuando aparece none
import numpy as np
import pandas as pd
# crear el diccionario, la manera mas COMOUN y CORRECTA DE TRABAJAR
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [25]:
df = pd.DataFrame(d)

In [26]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [24]:
df.dropna() # quita toda las filas que tiene NAN

     A    B  C
0  1.0  5.0  1

In [30]:
#elimina columnas con NAN
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [32]:
#por medio de un umbral, cuantas posiciones a eliminar
df.dropna(thresh=1) # como el Treshold

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [33]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [34]:
# llenar los nan
df.fillna(value="rellenar")

          A         B  C
0         1         5  1
1         2  rellenar  2
2  rellenar  rellenar  3

In [40]:
df['A'].fillna(value=df['A'].mean(),inplace=True) # Rellenarlos

In [42]:
df['B'].fillna(value=df['B'].mean(),inplace=True)

In [43]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

# Agrupaciones, alias "GroupBy"

In [57]:
data = {'Company':['GOOGLE','GOOGLE','MSFT','MSFT','FB','FB'],
       'Person':['Sam','José','Amy','Ray','Carl','Rene'],
       'Sales':[200,120,340,123,243,350]}

In [58]:
data

{'Company': ['GOOGLE', 'GOOGLE', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'José', 'Amy', 'Ray', 'Carl', 'Rene'],
 'Sales': [200, 120, 340, 123, 243, 350]}

In [59]:
df = pd.DataFrame(data) 
#debe ser del mismo tamaño 
# error: ypeError: Index(...) must be called with a collection of some kind, 1 was passed

In [61]:
byCompany = df.groupby('Company')

In [66]:
byCompany.sum()
 # promedio por compañia

         Sales
Company
FB         593
GOOGLE     320
MSFT       463

In [70]:
# Solo Facebook
byCompany.sum().loc['FB'] # recordar son corchetes

Sales    593
Name: FB, dtype: int64

In [73]:
df.groupby('Company').describe()

                    Sales
Company
FB      count    2.000000
        mean   296.500000
        std     75.660426
        min    243.000000
        25%    269.750000
        50%    296.500000
        75%    323.250000
        max    350.000000
GOOGLE  count    2.000000
        mean   160.000000
        std     56.568542
        min    120.000000
        25%    140.000000
        50%    160.000000
        75%    180.000000
        max    200.000000
MSFT    count    2.000000
        mean   231.500000
        std    153.442172
        min    123.000000
        25%    177.250000
        50%    231.500000
        75%    285.750000
        max    340.000000

In [74]:
df.groupby('Company').describe().transpose() # Traspuesta

Company    FB                                                        GOOGLE  \
        count   mean        std    min     25%    50%     75%    max  count
Sales     2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0    2.0

Company         ...                  MSFT                                    \
          mean  ...      75%    max count   mean         std    min     25%
Sales    160.0  ...    180.0  200.0   2.0  231.5  153.442172  123.0  177.25

Company
           50%     75%    max
Sales    231.5  285.75  340.0

[1 rows x 24 columns]

In [75]:
df.groupby('Company').describe().transpose()['FB'] # Traspuesta solo Facebook

       count   mean        std    min     25%    50%     75%    max
Sales    2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0

In [92]:
# No hay concatenacion demostremos

df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']},
                    index = [0,1,2,3])

In [93]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                    'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7'],
                    'D':['D4','D5','D6','D7']},
                    index = [4,5,6,7])

In [94]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                    'B':['B8','B9','B10','B11'],
                    'C':['C8','C9','C10','C11'],
                    'D':['D8','D9','D10','D11']},
                    index = [8,9,10,11])

In [99]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [101]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [102]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [105]:
# concatenar
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [106]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [110]:
izquierdo = pd.DataFrame({'Key':['K0','K1','K2','K3'],
                       'A':['A0','A1','A2','A3'],
                       'B':['B0','B1','B2','B3']})

In [111]:
derecho = pd.DataFrame({'Key':['K0','K1','K2','K3'],
                       'C':['C0','C1','C2','C3'],
                       'D':['D0','D1','D2','D3']})

# MERGE

In [112]:
pd.merge(izquierdo,derecho,how='inner', on='Key')

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [119]:
izquierdo = pd.DataFrame({
                       'A':['A0','A1','A2'],
                       'B':['B0','B1','B2']},
                        index = ['K0','K1','K2'])

In [120]:
derecho = pd.DataFrame({
                       'C':['C0','C1','C2'],
                       'D':['D0','D1','D2']},
                        index = ['K0','K2','K3'])

In [121]:
izquierdo.join(derecho)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

# OPERACIONES

In [126]:
df = pd.DataFrame({'col':[1,2,3,4],
                  'col2':[444,555,444,666],
                  'col3':['abc','def','ghi','xyz']})

In [127]:
df.head

<bound method NDFrame.head of    col  col2 col3
0    1   444  abc
1    2   555  def
2    3   444  ghi
3    4   666  xyz>

In [128]:
df['col2'].unique()

array([444, 555, 666])

In [131]:
len(df['col2'].unique())

3

In [134]:
df

   col  col2 col3
0    1   444  abc
1    2   555  def
2    3   444  ghi
3    4   666  xyz

In [136]:
def multiplica2(x):
    return x*2

In [142]:
# programacion funcional en python
df.apply(multiplica2)

   col  col2    col3
0    2   888  abcabc
1    4  1110  defdef
2    6   888  ghighi
3    8  1332  xyzxyz

In [144]:
# CIERRE, lambda es funcion anonima, x son todos los elementos
df.apply(lambda x: x*2)

   col  col2    col3
0    2   888  abcabc
1    4  1110  defdef
2    6   888  ghighi
3    8  1332  xyzxyz